In [1]:
import pandas as pd

In [5]:
df = pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/haberman/haberman.data',header=None)

In [6]:
df.columns = ['age','year_ops','pos_axi','status']

In [7]:
df.head()

   age  year_ops  pos_axi  status
0   30        64        1       1
1   30        62        3       1
2   30        65        0       1
3   31        59        2       1
4   31        65        4       1

In [8]:
df.describe()

              age    year_ops     pos_axi      status
count  306.000000  306.000000  306.000000  306.000000
mean    52.457516   62.852941    4.026144    1.264706
std     10.803452    3.249405    7.189654    0.441899
min     30.000000   58.000000    0.000000    1.000000
25%     44.000000   60.000000    0.000000    1.000000
50%     52.000000   63.000000    1.000000    1.000000
75%     60.750000   65.750000    4.000000    2.000000
max     83.000000   69.000000   52.000000    2.000000